---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarShape.HasEndTreatment
source: html/488b6145-c8b9-a18a-93d0-0b6449df7f52.htm
---
# Autodesk.Revit.DB.Structure.RebarShape.HasEndTreatment Method

Identifies if the rebar shape has end treatment at at least one end.

## Syntax (C#)
```csharp
public bool HasEndTreatment()
```

## Returns
Returns true if the rebar shape has end treatment for at least one end, false otherwise.